app/views/questions/_form_edit.html.erb

UPDATE "questions" SET "content" = $1, "updated_at" = $2 WHERE "questions"."id" = $3  [["content", "haha"], ["updated_at", "2019-12-04 16:48:27.216408"], ["id", 14]]
---
<%= simple_form_for [ @discipline, @discipline.questions.update(params[:discipline_id], { content: @question.content }) ] do |f| %>