app/helpers/examinations_helper.rb

  def disciplines_to_a
    Discipline.all.map do |i|
---
SELECT "disciplines".* FROM "disciplines"

  def random_questions
    questions = @discipline.questions.map(&:content)
---
SELECT "questions".* FROM "questions" WHERE "questions"."discipline_id" = $1  [["discipline_id", 2]]