app/helpers/lists_helper.rb

SELECT "examinations".* FROM "examinations"
---
  def examinations_to_a
    Examination.all.map do |i|

SELECT "examinations".* FROM "examinations" WHERE "examinations"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def examination_by_id(id)
    Examination.find(id)

SELECT "disciplines".* FROM "disciplines" WHERE "disciplines"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def discipline_by_id(id)
    Discipline.find(id)

SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
---
  def group_by_id(id)
    Group.find(id)