app/helpers/students_helper.rb

SELECT "groups".* FROM "groups"
---
  def fill_avaliable_groups
    @avaliable_groups = []
    Group.all.each do |i|