app/controllers/disciplines_controller.rb

  def index
    @disciplines = Discipline.all
---
SELECT "disciplines".* FROM "disciplines"

  def show
    @discipline = Discipline.find(params[:id])
---
SELECT "disciplines".* FROM "disciplines" WHERE "disciplines"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def edit
    @discipline = Discipline.find(params[:id])
---
SELECT "disciplines".* FROM "disciplines" WHERE "disciplines"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @discipline = Discipline.new(discipline_params)

    if @discipline.save
---
INSERT INTO "disciplines" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "ruby"], ["created_at", "2019-12-03 14:55:27.638278"], ["updated_at", "2019-12-03 14:55:27.638278"]]

  def update
    @discipline = Discipline.find(params[:id])

    if @discipline.update(discipline_params)
---
SELECT "disciplines".* FROM "disciplines" WHERE "disciplines"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "disciplines" SET "title" = $1, "updated_at" = $2 WHERE "disciplines"."id" = $3  [["title", "etest"], ["updated_at", "2019-12-03 14:56:06.687798"], ["id", 1]]

  def destroy
    @discipline = Discipline.find(params[:id])
    @discipline.destroy
---
SELECT "disciplines".* FROM "disciplines" WHERE "disciplines"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "disciplines" WHERE "disciplines"."id" = $1  [["id", 1]]