app/controllers/examinations_controller.rb

  def index
    @examinations = Examination.all
---
SELECT "examinations".* FROM "examinations"

  def show
    @examination = Examination.find(params[:id])
---
SELECT "examinations".* FROM "examinations" WHERE "examinations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def edit
    @examination = Examination.find(params[:id])
---
SELECT "examinations".* FROM "examinations" WHERE "examinations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @examination = Examination.new(examination_params)

    if @examination.save
---
INSERT INTO "examinations" ("date", "group_id", "discipline_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["date", "2019-12-05 14:55:00"], ["group_id", 12], ["discipline_id", 2], ["created_at", "2019-12-05 14:55:50.602728"], ["updated_at", "2019-12-05 14:55:50.602728"]]

  def update
    @examination = Examination.find(params[:id])

    if @examination.update(examination_params)
---
SELECT "examinations".* FROM "examinations" WHERE "examinations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "examinations" SET "date" = $1, "updated_at" = $2 WHERE "examinations"."id" = $3  [["date", "2019-12-05 01:45:00"], ["updated_at", "2019-12-05 15:16:14.687409"], ["id", 2]]

  def destroy
    @examination = Examination.find(params[:id])
    @examination.destroy
---
SELECT "examinations".* FROM "examinations" WHERE "examinations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "examinations" WHERE "examinations"."id" = $1  [["id", 1]]

  def questions
    @group = Examination.find(params[:id]).group
    @discipline = Examination.find(params[:id]).discipline
---
SELECT "examinations".* FROM "examinations" WHERE "examinations"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "disciplines".* FROM "disciplines" WHERE "disciplines"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]