app/controllers/examlists_controller.rb

  def index
    @examlists = Examlist.all
---
SELECT "examlists".* FROM "examlists"

    def set_examlist
      @examlist = Examlist.find(params[:id])
---
SELECT "examlists".* FROM "examlists" WHERE "examlists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]