app/controllers/groups_controller.rb

INSERT INTO "groups" ("name", "size", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "ИС-641"], ["size", 20], ["created_at", "2019-12-01 17:38:37.462162"], ["updated_at", "2019-12-01 17:38:37.462162"]]
---
  def create
    @group = Group.new(group_params)

    if @group.save

SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
UPDATE "groups" SET "name" = $1, "updated_at" = $2 WHERE "groups"."id" = $3  [["name", "test123"], ["updated_at", "2020-01-09 16:31:12.193578"], ["id", 33]]
---
  def update
    @group = Group.find(params[:id])

    if @group.update(group_params)

SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "groups" WHERE "groups"."id" = $1  [["id", 1]]
---
  def destroy
    @group = Group.find(params[:id])
    @group.destroy