app/controllers/lists_controller.rb

  def create
    @list = List.new(list_params)

    if @list.save
---
INSERT INTO "lists" ("examination_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["examination_id", 2], ["created_at", "2019-12-09 11:45:16.917969"], ["updated_at", "2019-12-09 11:45:16.917969"]]