app/controllers/questions_controller.rb

SELECT "disciplines".* FROM "disciplines" WHERE "disciplines"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "questions".* FROM "questions" WHERE "questions"."discipline_id" = $1 AND "questions"."id" = $2 LIMIT $3  [["discipline_id", 2], ["id", 5], ["LIMIT", 1]]
---
  def edit
    @discipline = Discipline.find(params[:id]) # ?
    @question = @discipline.questions.find(params[:discipline_id])

SELECT "disciplines".* FROM "disciplines" WHERE "disciplines"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "questions" ("content", "discipline_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "test"], ["discipline_id", 2], ["created_at", "2019-12-03 15:55:04.233095"], ["updated_at", "2019-12-03 15:55:04.233095"]]
---
  def create
    @discipline = Discipline.find(params[:discipline_id])
    @question = @discipline.questions.create(question_params)

SELECT "disciplines".* FROM "disciplines" WHERE "disciplines"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "questions".* FROM "questions" WHERE "questions"."discipline_id" = $1 AND "questions"."id" = $2 LIMIT $3  [["discipline_id", 2], ["id", 10], ["LIMIT", 1]]
UPDATE "questions" SET "content" = $1, "updated_at" = $2 WHERE "questions"."id" = $3  [["content", "ha1"], ["updated_at", "2019-12-04 16:55:51.300507"], ["id", 14]]
---
  def update
    @discipline = Discipline.find(params[:discipline_id])
    @question = @discipline.questions.find(params[:id])

    if @question.update(question_params)

SELECT "disciplines".* FROM "disciplines" WHERE "disciplines"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "questions".* FROM "questions" WHERE "questions"."discipline_id" = $1 AND "questions"."id" = $2 LIMIT $3  [["discipline_id", 2], ["id", 1], ["LIMIT", 1]]
DELETE FROM "questions" WHERE "questions"."id" = $1  [["id", 1]]
---
  def destroy
    @discipline = Discipline.find(params[:discipline_id])
    @question = @discipline.questions.find(params[:id])
    @question.destroy