app/controllers/questions_controller.rb

DELETE FROM "questions" WHERE "questions"."id" = $1  [["id", 2]]
---
  def destroy
    @discipline = Discipline.find(params[:discipline_id])
    @question = @discipline.questions.find(params[:id])
    @question.destroy