app/controllers/students_controller.rb

  def create
    @group = Group.find(params[:group_id])
    @student = @group.students.create(student_params)
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
INSERT INTO "students" ("number", "full_name", "group_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["number", 2], ["full_name", "Anastasyia P"], ["group_id", 12], ["created_at", "2019-12-01 17:57:46.614754"], ["updated_at", "2019-12-01 17:57:46.614754"]]

  def destroy
    @group = Group.find(params[:group_id])
    @student = @group.students.find(params[:id])
    @student.destroy
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "students" WHERE "students"."id" = $1  [["id", 3]]