app/controllers/students_controller.rb

SELECT "students".* FROM "students" ORDER BY id
---
  def index
    @students = Student.all

INSERT INTO "students" ("number", "full_name", "group_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["number", 2], ["full_name", "dima fedorov"], ["group_id", 13], ["created_at", "2019-12-02 23:28:33.158272"], ["updated_at", "2019-12-02 23:28:33.158272"]]
---
  def create
    @student = Student.new(student_params)

    if @student.save

SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "students" SET "full_name" = $1, "updated_at" = $2 WHERE "students"."id" = $3  [["full_name", "stanislav gusev"], ["updated_at", "2019-12-02 23:46:15.424917"], ["id", 5]]
---
  def update
    @student = Student.find(params[:id])

    if @student.update(student_params)