app/views/examinations/index.html.erb

      <td><%= examination.date %></td>
      <td><%= examination.group.name %></td>
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]