app/views/examinations/questions.html.erb


  <% @group.students.each do |student| %>
---
SELECT "students".* FROM "students" WHERE "students"."group_id" = $1  [["group_id", 12]]