app/views/examinations/show.html.erb

SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
---
  <strong>Group:</strong>
  <%= @examination.group.name %>